{
  "category": "3D-модели: поиск и подготовка",
  "entries": [
    {
      "title": "Где искать готовые 3D-модели для печати?",
      "description": "Описание:\nПользователь хочет найти модель для печати (например, мод для принтера или какую-то деталь), но не знает, на каких сайтах смотреть и как убедиться в качестве моделей.",
      "solution": "Решение:\nПопулярные репозитории 3D-моделей:\n• Printables.com – один из лучших ресурсов от Prusa. Много качественных моделей, удобный поиск, рейтинги авторов.\n• Thingiverse.com – старейшая платформа MakerBot. Больше всего моделей, но встречаются дубли и устаревшие, поиск неидеален. Тем не менее, почти любую вещь можно там найти.\n• Cults3D.com – коммерческий и бесплатный контент. Много эксклюзивных авторских работ, но за некоторые придется заплатить пару долларов.\n• MyMiniFactory.com – качественные модели, упор на фигуры, игрушки, арт. Есть проверка моделей.\n• Print3D, YouMagine, Pinshape – более мелкие сайты, тоже можно смотреть.\n\nТакже не забывайте про специальные подборки в социальных сетях: в Telegram существуют каналы, где выкладывают модели (в том числе платные в обход). Но это на свой риск и этичность.",
      "notes": "Полезно знать:\n• FlashForge AD5M сообщество: в Telegram-группе, помимо общения, в закрепах и разделе «Файлы» часто выкладываются полезные модели (держатели, обдувы и пр.). Можно воспользоваться поиском по чату – введите ключевые слова, например \"камера\", \"обдув мод\".\n• При скачивании моделей смотрите на рейтинг, количество скачиваний и комментарии – это подскажет качество. Лучше брать модели от известных авторов.\n• Некоторые авторы выкладывают модели только на своих патреонах или сайтах – имеет смысл погуглить конкретную вещь, возможно, она есть вне перечисленных платформ."
    },
    {
      "title": "Как эффективно искать нужную модель или мод?",
      "description": "Описание:\nБывает, нужна специфическая деталь (например, «держатель камеры для AD5M») и напрямую найти не получается.",
      "solution": "Решение (подход к поиску):\n• Определите ключевые слова на английском (и русском). Например: Adventurer 5M camera mount. Много моделей вообще не тегируются по-русски.\n• Ищите на крупных сайтах (Printables, Thingiverse и др.) по этим ключевым словам. Пробуйте разные вариации (camera mount, camera holder, cam support).\n• Используйте Google с фильтром по картинкам: иногда визуальный поиск сразу находит похожие объекты.\n• Проверьте сообщество Telegram: в группе AD5M можно спросить напрямую, но сначала попробуйте поиск по чату (чтобы не дублировать вопросы).\n• Если ищете мод для принтера – загляните в закрепленные сообщения или отдельный канал, посвящённый модификациям.\n\nКак правило, нужная модель обнаруживается на Printables или Thingiverse, если это что-то популярное. Если речь о редкой специфической вещи – возможно, придется моделировать самому или заказывать у автора.",
      "notes": "Полезно знать:\n• Есть короткий гайд, где советуют перед запросом в сообщество сделать фото детали и подобрать ключевые слова, это повышает шансы быстрого нахождения.\n• Если модель платная на Cults3D, а очень хочется бесплатно – люди часто «сливают» в Telegram, но стоит поддерживать авторов хороших моделей."
    },
    {
      "title": "Модель “не подходит” – распечатанная деталь не стыкуется или масштаб не тот",
      "description": "Описание:\nВы скачали модель, напечатали её, а она не выполняет свою функцию: может быть слишком велика или мала, отверстия не совпадают, крепление не подходит к вашему принтеру и т.п.",
      "solution": "Решение (пошагово):\n1. **Проверить размерность в слайсере**. Если STL явно не совпадает по габаритам, меняйте единицы (дюймы → мм). Иногда нужен масштаб 2540% или наоборот 0.0394 для пересчёта из дюймов.\n2. **Исправить мелкие несоответствия** (1–2%) путём масштабирования (99–101%). Это часто решает задачу «деталь чуть не садится». Но не переборщите, иначе нарушите посадку других частей.\n3. **Проверить калибровку принтера**:\n   - Если есть механические проблемы (неточность ремней, люфт по оси, «слоновья нога» от слишком прижатого первого слоя), размеры выходят неправильно.  \n   - При слишком высокой температуре стола или чрезмерном Z-offset деталь может «расплющиться» по нижней грани (Elephant Foot). Уменьшите температуру стола для первых слоёв или скорректируйте Z-offset (см. соответствующие проблемы в базе знаний).  \n   - Если большие погрешности (больше ~1 мм на 100 мм), возможно, стоит проверить натяжение ремней или шаги X/Y.\n4. **Учесть усадку материала**. ABS/ASA усаживается сильнее, PLA практически нет. Если модель автор делал под PLA, а вы печатаете ABS, то результат станет на долю миллиметра меньше.\n5. **Связаться с автором модели**. Иногда уже есть обновленная версия или variant для другой модели принтера. Или автор может оперативно править отверстия, если получит отзыв.",
      "notes": "Полезно знать:\n• «Слоновья нога» особенно заметна на широких плоских деталях, когда нижние слои расплавляются дольше (из-за высокой температуры стола) или если сопло слишком давит в первый слой (Z-offset мал). Это портит точность в основании.  \n• В большом обзоре (проблема «Эффект слоновьей ноги» на первом слое) описано, что для PLA достаточно 50–60 °C, а если делать 70–80 °C, вероятен расплыв по краям. И в слайсере есть функция Elephant Foot Compensation.  \n• Если принтер даёт неверный масштаб по осям (кружок получается овалом), может быть проблема с ремнями/шкивами (см. “Размеры отпечатка не соответствуют модели” в общей базе знаний). Тогда никакая подстройка в слайсере не поможет, нужно поправить механическое состояние принтера."
    }
  ]
}