{
    "category": "Интерфейс и управление",
    "entries": [
      {
        "title": "Меню экрана – какие разделы и функции?",
        "description": "Описание:\nПользователь хочет разобраться, что значат разделы в сенсорном меню принтера. Названия на английском, интерфейс не сразу очевиден.",
        "solution": "Решение:\nЭкранное меню AD5M разделено на несколько основных разделов:\n• Home: главная страница – показывает статус принтера, текущие температуры, позволяет запускать/останавливать печать, паузу. Здесь же отображается прогресс задания во время работы.\n• Settings (настройки): значок шестерёнки. В этом разделе настраивается подключение к Wi-Fi, выбор языка интерфейса, единицы измерения, базовые параметры печати (например, температура ожидания), а также можно выполнить сброс настроек (Reset) к заводским.\n• Leveling (калибровка): раздел автоуровня стола. Отсюда запускается процедура Auto Level, а также можно вручную подрегулировать Z-offset. Обычно на дисплее представлены шаги или числовые значения уровня.\n• Files/Print (файлы): список моделей для печати. Содержимое внутренней памяти и USB-накопителя (если вставлен). Отсюда выбирают модель и запускают печать. Также можно удалять файлы.\n• Info: раздел информации о принтере – здесь отображаются серийный номер, версии прошивки, IP-адрес при подключении к сети. Важно: через этот раздел осуществляется вход в инженерное меню (сервисное). Нужно нажать и удерживать «Machine Info» ~10 секунд, чтобы открыть скрытые настройки.\n\nИнтерфейс достаточно интуитивен, после пары сессий станет понятнее. Рекомендуется установить русский язык (через Settings -> Language), если он доступен.",
        "notes": "Полезно знать:\n• В инженерном меню (см. ниже) есть продвинутые опции: экспорт/импорт конфигурации, калибровка экрана, тест компонентов и прочие функции, которых нет в обычном меню.\n• Приложение FlashCloud/FlashMaker дублирует некоторые функции управления (запуск/остановка печати, мониторинг) на смартфоне, но базовые настройки проще делать прямо на экране."
      },
      {
        "title": "Как зайти в инженерное (сервисное) меню принтера?",
        "description": "Описание:\nСкрытое инженерное меню содержит дополнительные настройки и функции (экспорт конфигурации на флешку, калибровка тензодатчиков, ручное управление узлами и т.п.). Пользователь слышал, что оно существует, но не знает, как его открыть.",
        "solution": "Решение:\n1) Зайдите в раздел Info (значок «i» на экране).\n2) В списке версий и серийного номера найдите пункт «Machine Info» (или похожее название).\n3) Нажмите и удерживайте эту строку ~10 секунд. Должно появиться сервисное меню.\n4) Отпустите – вы в инженерном меню. Тут будут опции типа: Export/Import Config, Leveling Sensors Calibration, Screen Calibration, Factory Reset, Test Motors/Fans и т.д.\n\nИспользуйте эти функции осторожно. Factory Reset в инженерном меню может затронуть более глубокие настройки, чем обычный Reset в разделе Settings.",
        "notes": "Полезно знать:\n• Калибровка сенсорного экрана (Touchscreen Calibration) доступна только здесь.\n• После входа в инженерное меню, если ничего не делать, принтер может сам выйти из него через некоторое время."
      },
      {
        "title": "Калибровка сенсорного экрана (тачскрина)",
        "description": "Описание:\nСо временем (или после ремонта/замены) сенсор может работать неточно: нажатие по экрану не совпадает с реальным расположением кнопок, «курсор» смещён.",
        "solution": "Решение:\n• Войдите в инженерное меню (см. выше).\n• Найдите пункт Touchscreen Calibration.\n• Следуйте инструкциям на экране (обычно нужно нажимать стилусом на несколько крестиков или точек).\n• По окончании тач сохранит новые настройки.",
        "notes": "Полезно знать:\n• Делайте это только при реальной необходимости. В норме калибровка сохраняется надолго.\n• Если калибровка не помогла, возможно, проблема аппаратная (шлейф экрана или дефект сенсорной панели)."
      },
      {
        "title": "Есть ли мобильное приложение для управления принтером?",
        "description": "Описание:\nПользователь хотел бы контролировать принтер через смартфон: запускать задания, смотреть камеру, получать уведомления.",
        "solution": "Решение:\nДа, FlashForge предоставляет приложение FlashCloud/FlashMaker (ранее FlashCloud) для iOS/Android. Оно умеет:\n• Отправлять модели по Wi-Fi,\n• Мониторить состояние принтера (температура, прогресс),\n• Просматривать камеру (если фирменная),\n• Присылать уведомления о завершении печати или ошибках.\n\nДля использования:\n1) Создайте аккаунт FlashForge и залогиньтесь в приложении.\n2) Привяжите принтер (через QR-код на экране Info или введя серийный номер).\n3) Принтер появится в списке устройств в приложении.\n\nДалее можно запускать задания из облака или посылая слайсером в облако и управлять ими с телефона.",
        "notes": "Полезно знать:\n• Нужно интернет-подключение (принтер с Wi-Fi + облако). В локальной сети без интернета приложение не работает.\n• Альтернативы: на кастомных прошивках (Klipper) можно использовать OctoPrint, Mainsail/Fluidd, Telegram-ботов и т.п. На стоке — только FlashCloud/FlashMaker."
      },
      {
        "title": "Ограниченные возможности стоковой прошивки (FlashOS)",
        "description": "Описание:\nНа заводской прошивке FlashForge (FlashOS, основанной на Klipper) многие продвинутые функции ограничены. Пользователь может управлять только через экран и фирменное приложение. Нет доступа к полноценному веб-интерфейсу (Fluidd, Mainsail), нельзя напрямую редактировать конфигурационные файлы или пользоваться макросами.",
        "solution": "Решение:\n• Перейти на кастомную прошивку (KlipperMod, ZMod). Они предоставляют веб-интерфейс, SSH-доступ, возможность редактировать printer.cfg и добавлять макросы.\n• Либо получить root-доступ на стоковой прошивке (есть скрипты от сообщества), чтобы хотя бы заглянуть в логи и конфиги. Но полноценного UI (Fluidd/Mainsail) это не даёт.",
        "notes": "Полезно знать:\n• Формально кастомная прошивка может влиять на гарантию. Но при желании можно откатиться на сток, если сохранили бэкап.\n• Большинство функций, которые отсутствуют на экране (Input Shaper, SSH, детальный мониторинг температуры, макросы) становятся доступны на кастомной прошивке."
      },
      {
        "title": "Зависание при возобновлении печати после паузы",
        "description": "Описание:\nКогда вы ставите печать на паузу (например, из слайсера OrcaSlicer или PrusaSlicer) и затем пытаетесь возобновить, принтер зависает. На экране может висеть «Printing…», но движения не продолжаются. Управление через панель при этом недоступно.",
        "solution": "Решение:\n• Не ставить паузу из слайсера. Вместо этого, нажимайте Pause на экране принтера (Home → Pause). Возобновление после неё проходит штатно.\n• Если уже завис, придётся перезагружать принтер, а задание будет потеряно.\n• Убедитесь, что прошивка обновлена — в некоторых версиях баг может быть частично исправлен.\n• Рассмотрите переход на альтернативную прошивку (KlipperMod), где пауза/возобновление работает корректно в любых сценариях.",
        "notes": "Полезно знать:\n• Если вам нужна пауза для смены филамента, попробуйте встроенный функционал «Pause At Height» от слайсера. Или активируйте паузу вручную, но через экран.\n• На кастомных сборках Klipper есть полноценные макросы PAUSE/RESUME, которые можно вызывать как угодно, в том числе из слайсера."
      }
    ]
  }