{
  "category": "Механика",
  "entries": [
    {
      "title": "Стол стучит или ударяется при движении",
      "description": "Описание:\nПри перемещении платформы (стола) слышны резкие стуки, особенно во время быстрых перемещений или во время автоуровня. Визуально может быть заметен толчок или удар стола.",
      "solution": "Решение:\n1) Проверить параллельность рамы (портала). Отключите питание, слегка ослабьте 8 винтов крепления моторов X/Y, вручную подвигайте экструдер по диагоналям, чтобы снять перекос, и снова затяните винты.\n2) Полностью перекалибровать стол:\n   - Сбросить старую карту уровня (если возможно, через инженерное меню или удалив [bed_mesh] в конфиге).\n   - Запустить Auto Level заново. Убедиться, что нет «аномальных» точек.\n   - При необходимости чуть поднять Z-offset (например, на +0.1 мм) и проверить, исчезнет ли стук – возможно, сопло бьёт по столу.\n3) Убедиться, что ремни оси Y и направляющие закреплены без люфтов.\n4) После устранения перекоса и обновления карты стола стук обычно исчезает.",
      "notes": "Полезно знать:\n• Иногда «стук стола» – это частое касание соплом, если Z-offset чересчур низкий. Пробно увеличьте оффсет на +0.1 мм: если стук пропал, значит, дело было в неправильной высоте.\n• Если появились стуки внезапно, возможно, карта стола повредилась из-за сбоя (например, пропадал ток при автоуровне). Сброс и повторная калибровка решают проблему.\n• Следите за плавностью движения: платформа не должна заедать. Если чувствуется застревание, проверьте ремень, ролики или подшипники."
    },
    {
      "title": "Перетянуты винты крепления двигателей",
      "description": "Описание:\nНа некоторых экземплярах замечается, что винты, крепящие шаговые двигатели X/Y, затянуты чрезмерно. Это может повредить пластиковые узлы (трескаются, сминаются) и усложнить точность сборки (портал может перекоситься).",
      "solution": "Решение:\n1) Осмотреть узлы крепления: если заметны трещины или вдавленные шайбы – ослабьте эти винты.\n2) Для распределения нагрузки используйте широкие шайбы (4–5 мм) под головками винтов. Это не даст винтам «прорезать» пластик.\n3) Если резьбовая вставка в пластике прокручивается, зафиксируйте её эпоксидным или цианакриловым клеем.\n4) При обратной сборке затягивайте умеренно, без избыточного усилия.",
      "notes": "Полезно знать:\n• Некоторые пользователи печатают усиленные кронштейны или проставки для двигателей, защищая штатный пластик от растрескивания.\n• После вмешательства проверьте перекос и отрегулируйте заново параллельность портала (см. выше)."
    },
    {
      "title": "Люфт по осям X/Y (шатание головы или рамы)",
      "description": "Описание:\nПри покачивании рукой печатающей головки (или стола) чувствуется люфт. Во время печати возможны вибрации, рябь на стенках моделей, неточное позиционирование.",
      "solution": "Решение:\n1) Проверить и отрегулировать натяжение ремней. На AD5M обычно есть автонатяжители с пружиной, но стоит ослабить винты крепления моторов, вручную подвигать портал, дать ремням встать, затем равномерно затянуть.\n2) Устранить свободный ход подшипников:\n   - Для оси Y (стол): часто ставят тонкую подпружиненную пластину или напечатанную проставку под скользящий подшипник, чтобы плотнее прижать стол к направляющей.\n   - Для оси X (голова): некоторые делают 3D-печатную распорку (shim) в каретку экструдера, которая убирает боковой люфт.\n3) Затянуть все винты рамы: в том числе 8 винтов крепления двигателей X/Y. Но без фанатизма – можно вызвать трещину, если перетянуть (см. предыдущую проблему).\n4) После всех механических правок проверьте плавность перемещений вручную и заново сделайте автоуровень стола.",
      "notes": "Полезно знать:\n• Если вы сдвигали моторы и ремни, старая карта уровня (bed mesh) может стать неточной. Сбросьте и пересоздайте её.\n• Многие моды в сообществе посвящены устранению люфтов: Y-axis shim, X-carriage spacer и т.п. Установка таких проставок существенно улучшает чёткость печати.\n• Не затягивайте винты слишком сильно: можно повредить пластиковые крепления."
    },
    {
      "title": "Проблемные втулки или подшипники в натяжителях ремней",
      "description": "Описание:\nНа оси X/Y применяются ролики-натяжители. В них могут стоять пластиковые втулки или мини-подшипники, которые со временем изнашиваются, начинают прокручиваться или скрипеть. Это ослабляет натяжение ремней и вызывает посторонние звуки.",
      "solution": "Решение:\n1) Проверить ролики: при обслуживании (каждые 200–300 ч печати) посмотрите, болтаются ли ролики, не крутится ли втулка вместе с осью.\n2) Заменить втулки на качественные подшипники (либо новые втулки, но лучше шариковые/игольчатые). Для AD5M обычно подходят подшипники 5×8×2.5 мм.\n3) Есть моды, где вместо штатных натяжителей ставят улучшенные ролики с ручной регулировкой. Это позволяет точнее настраивать ремень и надёжнее фиксировать подшипник.\n4) После замены отрегулировать натяжение ремней заново, чтобы не было чрезмерной нагрузки.",
      "notes": "Полезно знать:\n• Подшипники лучше брать проверенных марок, дешёвые аналоги могут иметь люфт «с завода».\n• Следите за параллельностью и калибровкой после вмешательств — любая смена деталей на оси X/Y может повлиять на геометрию."
    },
    {
      "title": "Геометрия печати не соответствует модели (неточности по осям)",
      "description": "Описание:\nОтпечатанные детали выходят не по размеру, либо искажается форма (например, круги печатаются как овалы, отверстия меньше/больше). Это может проявляться при соединении деталей – они не стыкуются как должны.",
      "solution": "Решение:\n1) Натянуть ремни (см. выше).\n2) Проверить, что винты шкивов на валах двигателей затянуты и шкивы не люфтят.\n3) Напечатать калибровочный куб (напр. 100×100 мм), замерить фактический размер. Если отклонение систематическое (например, 99.2 мм вместо 100), иногда корректируют шаги в прошивке (на Klipper через printer.cfg). Но на стоковом FlashOS это недоступно – в таком случае лучше воспользоваться «Horizontal Size Compensation» в слайсере (PrusaSlicer, OrcaSlicer), чтобы компенсировать мелкие отличия.\n4) Убедиться, что нет эффекта «слоновьей ноги» (Elephant Foot) – когда нижние слои раздавлены и деталь снизу шире. Это тоже искажает размеры (уменьшает отверстия). Если такое есть, уменьшите температуру стола для первых слоёв и/или поднимите Z-offset.",
      "notes": "Полезно знать:\n• Обычно AD5M из коробки печатает довольно точно, серьёзные расхождения связаны с механикой (ремни, люфт) или чрезмерным давлением на первый слой.\n• Корректируйте экструзию (flow) тоже осторожно, ведь избыточный поток расширяет линии и уменьшает отверстия."
    },
    {
      "title": "Вибрации и скрипы корпуса",
      "description": "Описание:\nВо время работы принтера слышны посторонние дребезжащие звуки, высокочастотные вибрации или скрипы. Исходят от стенок корпуса или внутренней обшивки.",
      "solution": "Решение:\n1) Определить источник вибрации: аккуратно прижмите руками подозрительные детали во время печати. Если звук исчез или меняется – значит, нашли слабое место.\n2) Проклейка и демпфирование:\n   - Нанесите тонкий слой силиконового герметика, или вставьте кусочек вспененного скотча / резиновой прокладки в щель между вибрирующими частями.\n   - Дополнительно можно подклеить провода и штекеры, чтобы не болтались.\n3) Убедитесь, что принтер стоит на ровной, жёсткой поверхности. Иногда вибрирует и сам стол, на котором стоит принтер.",
      "notes": "Полезно знать:\n• Не заливайте герметик повсюду – ограничьтесь точками, иначе потом будет трудно разобрать при ремонте.\n• Если шум исходит от верхней крышки или дверцы, добавьте маленькие прокладки из поролона/резины в месте контакта."
    }
  ]
}