{
    "category": "Модификации и апгрейды",
    "entries": [
      {
        "title": "Открытый корпус – необходимость закрыть камеру для ABS/ASA",
        "description": "Описание:\nFlashForge AD5M имеет открытый спереди и сверху корпус (особенно модель 5M, не Pro). При печати пластиками типа ABS, ASA, PC возникают деформации из-за сквозняков и недостатка температуры в камере. Пользователь хочет улучшить термостабильность.",
        "solution": "Решение (варианты модификации корпуса):\n1) Минималистичный корпус: набор панелей, закрывающих основные отверстия. Обычно это передняя дверца и простая верхняя крышка. Удерживает часть тепла, прост в изготовлении.\n2) Полноразмерная зашивка: комплект панелей, закрывающий перед, верх и боковые щели. Лучшее удержание тепла и шумоизоляция, но нужно больше пластика и крепежа.\n3) ILYAS mod: кастомный корпус от пользователя ILYAS (подробности в сообществе).\n4) Официальный кит FlashForge: фирменный комплект акриловых панелей. Плюс – заводское решение с точной подгонкой, минус – цена.\n5) «Superliminal» мод (Printables): металлические уголки + панели, повышающие жёсткость конструкции.\n6) Гибрид под родные панели: проект для установки официальных панелей с минимальным числом печатных деталей.",
        "notes": "Полезно знать:\n• В закрытом корпусе электроника может греться сильнее. Следите за температурой блока питания и платы управления.\n• Для PLA, PETG полный закрытый корпус не обязателен (PLA обычно лучше печатать при открытом объёме).\n• При желании можно дополнить корпус фильтрацией (см. ниже)."
      },
      {
        "title": "Недостаточное обдувание модели (качество охлаждения)",
        "description": "Описание:\nНа высоких скоростях или при печати мелких деталей штатного обдува иногда не хватает – пластик не успевает остыть, появляются нитки, огрехи на нависаниях. Особенно чувствительно для PLA.",
        "solution": "Решение (моды на обдув):\n• **Боковой обдув** (вентилятор 120/140 мм сбоку): Установка крупного вентилятора сбоку камеры, обеспечивая мощный поток воздуха. Крепится на боковую стенку/раму, требует напечатанного кронштейна.\n• **Новый кожух обдува на голову**: Печатные насадки для равномерного обдува вокруг сопла. Часто идёт в связке с заменой хотэнда (например, Bambu-мод), где требуется своя система обдува.\n• **Обдув электронной платы**: Можно доработать скрипт управления вентилятором платы, чтобы уменьшить шум и износ. Но это не про качество печати напрямую, скорее про улучшение акустики.",
        "notes": "Полезно знать:\n• Сильный обдув понижает температуру внутри камеры, учтите это при печати ABS – возможно, его нужно отключать или снижать.\n• Для PLA обдув критически важен, для ABS – минимален.\n• Обычно ставят вентиляторы 5015, 3010 и т.п., печатают переходники/воздуховоды. Много готовых моделей на Printables."
      },
      {
        "title": "Требуется поддержание температуры и фильтрация воздуха в камере",
        "description": "Описание:\nПри печати требовательных материалов (ABS, нейлон) хочется удерживать высокую температуру, а также фильтровать выходящий воздух (запах, частицы).",
        "solution": "Решение:\n• **Пассивная термокамера**: Закрытие корпуса (см. выше). Чаще всего этого достаточно, ведь стол и хотэнд сами дают тепло. Если нужно ещё выше температуру, ставят небольшой нагревательный элемент и термостат, но это сложнее.\n• **Фильтрация**: Устанавливают вентилятор (5015, 7530 и т.д.) и активный угольный или HEPA-фильтр на выходе. Есть кастомные задние панели, куда монтируется фильтр.\n• **Рециркуляция**: Часть пользователей организует выдув через фильтр наружу. Другие – через верх, но тогда камера может остывать. Нужно искать баланс.\n• **Шумоизоляционный колпак**: дополнительно гасит звук работы.",
        "notes": "Полезно знать:\n• Следите за температурой в камере – мощный вытяжной вентилятор может свести на нет эффект «тёплой» камеры.\n• Угольные картриджи нужно менять периодически.\n• Нагреватель внутри камеры – крайне осторожно, чтобы не перегреть электронику."
      },
      {
        "title": "Недостаточная подсветка области печати",
        "description": "Описание:\nСтоковая AD5M может не иметь яркого освещения внутри. Это осложняет наблюдение за печатью и портит видимость для камеры.",
        "solution": "Решение (подсветка):\n• Подключить LED-ленту 24 В к разъёму принтера (есть 2-pin выход). Или использовать 12 В ленту через понижающий модуль (LM2596).\n• Напечатать держатель/корпус для ленты – вариантов много на Printables (магнитное крепление, COB-ленты и т.д.).\n• Некоторые ставят светодиод прямо на голову экструдера, чтобы подсвечивать зону печати «сейчас». Требуется небольшой DC-DC модуль, подключение 24→5/12В.",
        "notes": "Полезно знать:\n• Обычно подсветку включают/выключают через меню принтера (если запитана штатно).\n• COB-ленты дают равномерный рассеянный свет, обычные LED – точечный."
      },
      {
        "title": "Мониторинг печати через камеру",
        "description": "Описание:\nПользователь хочет видеть процесс печати или снимать таймлапсы. Нужно установить камеру.",
        "solution": "Решение (варианты):\n• **Оригинальная камера FlashForge**: лучше всего совместима. Продаётся отдельно, подключается внутри принтера, выводит видео в FlashCloud/FlashMaker.\n• **Обычные USB-камеры**: Работают при кастомной прошивке (KlipperMod), позволяя смотреть видео через Mainsail/Fluidd. На стоке – не поддерживается напрямую.\n• **Arducam / Logitech / OV**: Существует много проектов крепления, нужно смотря что у вас за камера.\n• **Внешняя IP-камера**: Некоторые ставят просто IP-камеру на штатив у принтера. Это проще, но не так элегантно.",
        "notes": "Полезно знать:\n• Камера внутри камеры (замкнутой) может перегреваться при ABS-печати. Место и форма крепления важны.\n• Убедитесь, что провода не мешают движению."
      },
      {
        "title": "Отсутствует кнопка питания на версии 5M (не Pro)",
        "description": "Описание:\nУ базовой Adventurer 5M нет аппаратной кнопки включения/выключения. Приходится выдёргивать шнур или пользоваться сетевым фильтром.",
        "solution": "Решение:\n• Установить дополнительный сетевой выключатель: подходящий тумблер или кнопку. Нужно вырезать отверстие в корпусе и последовательно врезать её в цепь питания.\n• Использовать внешние решения (удлинитель/розетка с кнопкой). Проще, но менее красиво.\n• Существуют готовые наборы (комплект кнопки и провода), иногда упоминающиеся в сообществе.",
        "notes": "Полезно знать:\n• Соблюдайте требования электробезопасности – при работе со 110/220 В.\n• Удобно ставить кнопку на заднюю/боковую панель там, где у Pro штатно."
      },
      {
        "title": "Шумный вентилятор блока питания",
        "description": "Описание:\nСамый громкий звук может исходить от вентилятора в блоке питания (БП). Он часто крутится на максимальных оборотах непрерывно.",
        "solution": "Решение:\n1) **Замена вентилятора** на более тихий (Noctua, Sunon, Delta quiet series). Обязательно того же форм-фактора (40/60 мм и т.д.), с таким же напряжением.\n2) **Понижение оборотов** (резистор, понижающий модуль). Опасно, если БП будет недоохлаждаться. Делайте лишь с осторожностью, проверяйте температуру.\n3) **Добавить термоконтроль** (электронщик-энтузиаст может врезать термодатчик). Или заменить БП целиком на более качественный.\n4) **Дополнительные отверстия** в районе БП, чтобы улучшить приток/отток воздуха и снизить шум воздушного потока.",
        "notes": "Полезно знать:\n• После таких модификаций тщательно тестируйте БП на перегрев (потрогайте радиаторы после долгой печати, не выше 60–65 °C).\n• В крайнем случае, можно вынести БП наружу (отдельным блоком), но это более радикальное решение."
      },
      {
        "title": "Установка альтернативного хотэнда (соплемод, Bambu Lab style, K1 и др.)",
        "description": "Описание:\nШтатный картридж AD5M неразборный. Многие хотят иметь обслуживаемый/разборный хотэнд, менять сопла, экспериментировать с материалами. Сообщество разработало альтернативные хотэнды – «соплемод» (он же «соплямод»), Bambu Lab style, Creality K1 mod и др.",
        "solution": "Решение (общая схема):\n1) **Приобрести или напечатать** нужный комплект деталей (радиатор, нагревательный блок, крепёж). «Соплемод» предполагает другой радиатор и вкручивающееся сопло, заменяющее штатный картридж. «Bambu Lab style» – устанавливает хотэнд от BambuLab X1. «K1 mod» – от Creality K1.\n2) **Смонтировать** новый хотэнд на место заводского. Возможно, придётся поменять кулер, напечатать новый кожух обдува.\n3) **Настроить прошивку**. На стоковом FlashOS нельзя легко менять длину сопла, PID и термодатчик. Часто приходится переходить на кастомную прошивку (KlipperMod, ZMod), где редактируют printer.cfg. Или использовать скрипт root-доступа, чтобы внести изменения в конфиги.\n4) **Учесть охлаждение**: некоторые моды (соплемод) имеют длиннее радиатор, что может приводить к перегреву внутри корпуса или меняет распределение тепла. Следите за стабильностью.",
        "notes": "Полезно знать:\n• При автоуровне (тензодатчики) другой хотэнд может иначе нажимать на стол, и периодически возникают ошибки E0011, если высота сильно отличается. Нужно перенастроить Z-offset.\n• Если вы не хотите терять гарантию, лучше использовать заводские картриджи. Любой кастомный хотэнд – это углублённая модификация, технически сложнее.\n• Обзор разных хотэнд-модов: в Telegram чате AD5M или на Printables есть сборки «Bambu Lab style for AD5M», «soply mod» и т.д.\n• После установки таких модов обычно появляется возможность печатать высокотемпературные пластики (PEEK, PC), но только если сам хотэнд и термодатчик рассчитаны на эти температуры."
      },
      {
        "title": "Переход на кастомную прошивку (KlipperMod, ZMod)",
        "description": "Описание:\nСтоковая прошивка FlashOS ограничивает возможности: нет SSH, нет полноценного веб-UI (Fluidd/Mainsail), нельзя редактировать printer.cfg и макросы. Множество продвинутых апгрейдов (Input Shaper, Pressure Advance, гибкая настройка хотэнда) упираются в закрытость стока.",
        "solution": "Решение:\n1) **Установить KlipperMod (xblax)** или **ZMod (ghzserg)** – наиболее известные сборки. Они дают веб-интерфейс (Fluidd или Mainsail), SSH-доступ, возможность менять конфиги на лету.\n2) **Сделать backup** стоковых файлов (printer.cfg, прошивки), чтобы при необходимости вернуться.\n3) **Следовать инструкции** из GitHub или Telegram сообщества (обычно нужно прошить ядро Linux, заменить SD-образ, загрузить адаптированный Klipper).\n4) **Настроить** новые параметры: PID, Z-offset, Steps per mm, Input Shaper, и т.д.",
        "notes": "Полезно знать:\n• Переход на кастомную прошивку может влиять на гарантию, но при наличии резервной копии стока можно откатиться, если что.\n• KlipperMod упрощает работу с любыми «upgrade» – от хотэнда до камер, потому что всё редактируется в одном конфиг-файле.\n• ZMod похож, но имеет другие плюшки (свои макросы, инструменты). Выбирайте по вкусу.\n• На кастомной прошивке становится проще подключить USB-камеру, взять root-доступ, управлять принтером через браузер. Однако ответственность за правильность настроек несёте вы сами."
      }
    ]
  }