{
   "category": "Обслуживание",
   "entries": [
     {
       "title": "Необходимость смазки и чистки направляющих",
       "description": "Описание:\nСо временем движения по осям могут стать более шумными или менее плавными. Принтер требует периодического техобслуживания: очистки и смазки движущихся частей.",
       "solution": "Решение (регулярно):\n1) **Что смазывать**: линейные направляющие осей X и Y, винтовую пару оси Z, подшипники (если есть доступ).\n2) **Чем смазывать**: густая консистентная термостойкая смазка (Циатим-221, литиевая, специальная для 3D-принтеров), либо качественное силиконовое масло.\n3) **Как**:\n   - Сначала очистить рельсы от пыли, старой смазки мягкой ветошью.\n   - Нанести тонкий слой новой смазки, вручную поводить каретку/стол, чтобы она вошла внутрь подшипников.\n4) **Периодичность**: ~каждые 100–150 часов печати или раз в 1–2 месяца. Если принтер стоит в пыльном помещении, возможно чаще.",
       "notes": "Полезно знать:\n• Не наносите слишком много смазки – излишки быстрее собирают пыль.\n• У новых принтеров заводская смазка быстро вырабатывается в первые недели – не откладывайте первое ТО.\n• Есть детальные видео/гайды в сообществе по правильному распределению смазки."
     },
     {
       "title": "Когда и как менять ремни привода",
       "description": "Описание:\nРеменные передачи X/Y со временем растягиваются, стареют или изнашиваются (трескаются). Это приводит к люфту, потере точности, шумам.",
       "solution": "Решение:\n• **Признаки для замены**: трещины на ремне, повышенная растяжённость (автонатяжитель «уходит в конец»), люфт, сложности калибровки, либо обрыв ремня.\n• **Процедура замены**:\n  1) Ослабить один конец старого ремня.\n  2) Прикрепить новый ремень к старому (скотчем, стяжкой) и осторожно протянуть, вытягивая старый – новый займёт его место по всем роликам.\n  3) Закрепить новый ремень в том же месте, отрегулировать натяжение.\n• **После**: проверить, что ремень лежит ровно по шкивам. Сделать заново автоуровень и тестовый куб, т.к. геометрия может слегка измениться.",
       "notes": "Полезно знать:\n• Есть инструкции и видео, как менять ремни без полного разбора портала – это экономит время.\n• Храните старые ремни – их куски пригодятся в быту (фильтр для нити, фиксация и т.д.)."
     },
     {
       "title": "Ослабление и настройка ремней (натяжение ремней)",
       "description": "Описание:\nДаже если ремень не требуется менять, он может ослабнуть со временем. Автонатяжители на пружинах не всегда компенсируют.",
       "solution": "Решение:\n1) **Регулировка**:\n   - Сзади принтера ослабляем крепёж двигателей X/Y (4 винта на каждом моторе), позволяя пружинам натянуть ремни.\n   - Подвигайте вручную стол и голову, затем затяните винты обратно.\n2) **Проверка**: ремни не должны провисать, но и не быть чрезмерно «как струна». Лёгкое щипковое движение даёт приглушённый звук.\n3) Если пружины уже не справляются (ремни «растянулись» слишком сильно) – пора замена.",
       "notes": "Полезно знать:\n• Существуют моды с более жёсткими пружинами или ручной регулировкой для точной подстройки.\n• После перенатяжки ремней обязательно сделайте автоуровень заново."
     },
     {
       "title": "Регулярная чистка и обезжиривание стола (PEI/ультрабаза)",
       "description": "Описание:\nПри долгом использовании на столе накапливаются отпечатки пальцев, остатки пластика или клея, что ухудшает адгезию. Первый слой начинает прилипать хуже, возможны отлипания.",
       "solution": "Решение (периодически, особенно перед важной печатью):\n1) Протрите стол салфеткой, смоченной изопропиловым спиртом или другим обезжиривающим раствором (например, «Средство для стёкол» без добавок).\n2) Если имеются остатки пластика – аккуратно удалите их деревянным или пластиковым скребком (не металлическим, чтобы не поцарапать покрытие).\n3) При серьёзных загрязнениях можно снять PEI-лист (если съёмный) и помыть в тёплой воде с мылом, затем высушить.\n4) Старайтесь не трогать поверхность пальцами после очистки. Масло с кожи может ухудшить прилипание.",
       "notes": "Полезно знать:\n• Удобно делать такую очистку хотя бы раз в неделю или после серии больших печатей.\n• Если PEI-лист имеет царапины, их иногда можно слегка зашлифовать очень мелкой наждачкой, но аккуратно.\n• Некоторые используют клей-карандаш или лак для волос на проблемных пластиках (ABS, нейлон), но при этом чистка будет нужна ещё чаще."
     },
     {
       "title": "Периодическая прочистка экструзии (cold pull, удаление нагара)",
       "description": "Описание:\nДаже при использовании качественного пластика в сопле со временем может скапливаться нагар, пыль или остатки старого материала. Это провоцирует частичные засоры.",
       "solution": "Решение (каждые 100–200 часов печати или при смене пластика):\n1) **Cold pull**: нагреваем хотенд (220–250 °C для PLA/PETG, выше для нейлона), вставляем нейлоновую нить или специальную очистную. Затем охлаждаем до ~90–100 °C и резко вытягиваем. Загрязнения выходят вместе с нитью.\n2) Если cold pull не помогает – аккуратная прочистка тонкой иглой при температуре.\n3) Осмотр сопла: если оно сильно изношено или задрано, лучше заменить на новое (особенно если это картриджный формат).",
       "notes": "Полезно знать:\n• Это скорее «экструдерное обслуживание», но важно в рамках общего ухода. Многие проблемы (непрочная подача, периодические щелчки) решаются регулярной профилактикой.\n• Не допускайте ситуации, когда пластик «часами томится» в горячем сопле без движения – так нагар образуется быстрее."
     },
     {
       "title": "Частые поломки и их решения (аппаратные неисправности)",
       "description": "Описание:\nИногда встречаются однотипные аппаратные проблемы: повреждение шлейфа экрана, оплавление разъёма, прокрутка резьбовых втулок. Это тоже относится к области обслуживания и ремонта.",
       "solution": "1) **Повреждённый шлейф экрана**:\n   - Симптомы: экран не включается, искажается изображение, тач не работает.\n   - Решение: заменить FFC-шлейф на идентичный по длине и числу контактов. Временно можно «обхитрить» залом, но надёжнее купить новый.\n\n2) **Оплавившийся разъём стола/головы**:\n   - Симптомы: пропал нагрев, видно оплавление.\n   - Решение: заменить разъём и проверить цепь на КЗ. Паять аккуратно, если нет навыков – обратиться к сервису.\n\n3) **Прокручивание втулки в пластике**:\n   - Причина: перетянули винт, сорвана латунная вставка.\n   - Решение: посадить втулку на клей (эпоксид), либо установить новую вставку, если внутренняя резьба сорвана. При последующей сборке не затягивать чрезмерно.",
       "notes": "Полезно знать:\n• Все три проблемы чаще возникают после длительной эксплуатации. Регулярный осмотр (в т.ч. разъёмов и шлейфов) помогает обнаружить их на ранней стадии."
     },
     {
       "title": "Разборка принтера для ремонта или моддинга",
       "description": "Описание:\nИногда нужно снять корпус, портал, получить доступ к плате или каретке для глубокого обслуживания.",
       "solution": "Решение:\n• FlashForge имеет официальные видео-инструкции (на их YouTube-канале), показывающие разбор и сборку основных узлов – экструдера, портала, шкивов, электроники.\n• Общий порядок: обесточить принтер, подождать остывания хотэнда/стола, аккуратно снять панели (учитывая шлейф экрана), выкрутить нужные винты.\n• При повторной сборке обращайте внимание на правильное расположение проводов, чтобы они не попадали в зону движения портала.",
       "notes": "Полезно знать:\n• Перед серьёзной разборкой сфотографируйте расположение кабелей и шлейфов, это упростит обратную сборку.\n• Если снимали моторы или ремни, потом потребуется перекалибровать уровень стола и проверить точность по осям."
     },
     {
       "title": "Советы по обслуживанию для новичков (обобщение)",
       "description": "",
       "solution": "",
       "notes": "Полезно знать (кратко):\n• После любых механических вмешательств (замена ремней, снятие портала, даже корректировка винтов) заново сделайте автолевел (стол).\n• Чистите и обезжиривайте стол (PEI) как минимум раз в несколько печатей.\n• Применяйте смазку на рельсы X/Y и винт Z каждые ~100–150 часов.\n• Периодически (раз в 100–200 ч печати) делайте cold pull для профилактики засоров, особенно при смене пластика.\n• Не тяните винты слишком сильно – можно повредить пластиковые вставки.\n• Если принтер стоит в пыльном месте, нужно чаще обслуживать (убирать пыль, следить за вентиляторами).\n• Храните инструкции и фотографии сборки. В случае чего, проще будет вернуть всё на место."
     }
   ]
 }