{
   "category": "Прошивка",
   "entries": [
     {
       "title": "Доступные прошивки (стоковая и альтернативные)",
       "description": "Описание:\nПринтер поставляется с фирменной прошивкой FlashForge (FlashOS), основанной на Klipper, но с закрытым интерфейсом. Многие пользователи ищут альтернативы для расширенных функций.",
       "solution": "Решение: Доступно несколько прошивок:\n• **Стоковая FlashOS**: предустановлена производителем, на базе Klipper, поддерживает Wi-Fi, облачный сервис FlashCloud/FlashMaker и печать файлов с расширением .gco. Интерфейс — только через сенсорный экран (без веб).\n• **ZMod (ghzserg)**: модификация стоковой прошивки. Открывает доступ к конфигурационным файлам (printer.cfg), SSH, даёт Fluidd/Mainsail для удалённого управления. Сохраняет часть функций стока (автосохранение Z-offset и пр.).\n• **KlipperMod (xblax)**: своя система на базе Raspberry Pi OS + Klipper. Устанавливается как образ на флешку. Имеет веб-интерфейс (Fluidd/Mainsail), набор макросов, SSH-доступ.",
       "notes": "Полезно знать:\n- ZMod репозиторий: github.com/ghzserg/zmod\n- KlipperMod репозиторий: github.com/xblax/flashforge_ad5m_klipper_mod\n- Перед переходом на модифицированную прошивку сделайте резервные копии оригинальных файлов, чтобы при необходимости вернуться.\n- Если принтер работает стабильно, не обязательно спешить с кастомными прошивками."
     },
     {
       "title": "Как установить кастомную прошивку (пример: KlipperMod)",
       "description": "Описание:\nЖелающие перейти на альтернативную прошивку (например, KlipperMod) могут столкнуться с непонятным порядком действий.",
       "solution": "Решение (пример на KlipperMod):\n1) **Загрузка образа**: Берём готовый образ системы KlipperMod из репозитория.\n2) **Подготовка флешки**: Форматируем USB-накопитель в FAT32 и распаковываем образ (файлы) в корень флешки (не архивом).\n3) **Установка**: Вставляем флешку в выключенный принтер, включаем. Принтер найдёт образ и начнёт установку. Ждём несколько минут до завершения.\n4) **Перезагрузка**: Принтер сам перезапустится. Теперь на экране / по сети будет видно, что работает KlipperMod (Fluidd/Mainsail, SSH).",
       "notes": "Полезно знать:\n- Не отключайте питание во время установки!\n- После кастомной прошивки не используйте штатное меню обновления принтера – обновляйтесь вручную, иначе можно «окирпичить» систему.\n- Храните файлы родной прошивки, чтобы вернуться на сток в случае необходимости."
     },
     {
       "title": "Лимит температуры сопла (291 °C) и высокотемпературная печать",
       "description": "Описание:\nПо умолчанию прошивка не даёт разогревать сопло выше ~291 °C. Это мешает печатать некоторые материалы (PC, нейлон+ и др.), которым нужно 300 °C+.",
       "solution": "Решение (разблокировка температуры):\n1) Редактировать printer.cfg (через root/SSH или инженерное меню):\n   - Ищем секцию [verify_heater extruder].\n   - Увеличиваем max_temp или max_error до 340–350 (например).\n2) Сохранить, перезапустить прошивку (RESTART). Теперь можно ставить 300 °C+.",
       "notes": "Полезно знать:\n- На стоке физически обычно не рекомендовано поднимать выше ~300 °C (герметик плавится). Будьте осторожны.\n- Для изменения конфигов нужен доступ (ZMod, KlipperMod или root).\n- Ссылка на гайд: FF_5M_5M_Pro/12695/158024 (Telegram)."
     },
     {
       "title": "Получение root-доступа и SSH на стоковой прошивке",
       "description": "Описание:\nЧтобы редактировать системные файлы, конфиги, устанавливать пакеты, нужен root-доступ. По умолчанию FlashOS это блокирует.",
       "solution": "Решение:\n1) **Скрипт для разблокировки**: скачиваем и распаковываем на флешку.\n2) Включаем принтер с вставленной флешкой – скрипт отработает и откроет SSH-доступ.\n3) Подключаемся по SSH (IP принтера, порт 22 или 23), логин root, пароль 123456 (по умолчанию).",
       "notes": "Полезно знать:\n- Инструкции и архив скрипта лежат на GitHub, либо в сообществе Telegram.\n- Меняйте пароль после входа, иначе принтер уязвим в сети.\n- Осторожно редактируйте системные файлы: при ошибке можно нарушить работу."
     },
     {
       "title": "Принтер завис на экране «Firmware Update» и не загружается",
       "description": "Описание:\nБывает, что после установки кастомной прошивки или сброса принтер при старте висит на окне «Firmware Update» и не идёт дальше.",
       "solution": "Решение:\n1) **Не нажимайте** «Update».\n2) **Войти в инженерное меню** (Info → нажать Machine Info ~10 сек) и отключить Wi-Fi. Без интернета прошивка не сможет выйти в облако и перестанет требовать обновления.\n3) Перезагрузить – принтер должен пропустить автообновление.\n4) Если не помогло – перезаписать конфиг на флешке (например, printer.cfg) или перепрошить офлайн, чтобы вернуть систему в рабочее состояние.",
       "notes": "Полезно знать:\n- Не соглашайтесь на онлайн-обновление, если у вас кастомная прошивка. Это почти наверняка «окирпичит» принтер.\n- Отключение Wi-Fi часто решает зависания на окне обновления."
     },
     {
       "title": "Принтер не распознает файл прошивки на флешке",
       "description": "Описание:\nХотите обновиться вручную, но принтер не видит или не запускает файл прошивки. Меню Update пустое.",
       "solution": "Решение:\n1) Форматируйте флешку в FAT32, объём до 32 ГБ.\n2) Распакуйте архив прошивки в корень (не просто .zip, а файлы .mo и т.п. прямо в корне).\n3) Убедитесь, что название файла (например, Orca-FlashForge.mo) совпадает с инструкцией.\n4) Если упорно не определяется – попробуйте другую флешку.",
       "notes": "Полезно знать:\n- При успехе после перезагрузки на экране появится предложение обновиться. Или обновление начнётся автоматически (зависит от версии прошивки).\n- Большие или «экзотические» флешки могут не определяться принтером корректно."
     },
     {
       "title": "Принтер не загружает файл printer.cfg с флешки",
       "description": "Описание:\nПри попытке импортировать собственный printer.cfg (например, для изменения PID/лимитов) принтер не видит файл или игнорирует.",
       "solution": "Решение:\n1) Убедиться, что имя: “printer.cfg” (без заглавных, без пробелов, без лишнего расширения).\n2) Корень флешки, FAT32, объём ≤32 ГБ.\n3) Сохранить в кодировке UTF-8 без BOM.\n4) Вставить флешку до входа в инженерное меню, затем выбрать Import Config.",
       "notes": "Полезно знать:\n- При успешной загрузке принтер обычно просто вернётся в меню без сообщений.\n- Если конфиг с синтаксическими ошибками, прошивка может его проигнорировать."
     },
     {
       "title": "Принтер зависает при длительной печати (перегрев MCU)",
       "description": "Описание:\nВо время продолжительной печати (особенно при высокой температуре хотэнда / стола) принтер неожиданно зависает и перестаёт реагировать. Иногда на экране появляется ошибка, связанная с температурой или «MCU shutdown».",
       "solution": "Решение:\n1) **Обновить прошивку** до последней версии (FlashForge OS 3.1.3 и выше) или перейти на KlipperMod/ZMod. Известны случаи, когда старые версии имели баги с утечками памяти и зависали.\n2) **Проверить соединения** (нагреватель, термистор). Любые оголённые провода / шлейфы нужно изолировать.\n3) **Следить за охлаждением MCU**: если внутри камеры сильно жарко (печать ABS при +50 °C), электроника может перегреться. Оставьте хотя бы небольшой приток воздуха, или не закрывайте вентиляционные зоны.\n4) **PID tune** заново (пр.: `PID_CALIBRATE HEATER=extruder TARGET=240`) – убедитесь, что в printer.cfg правильные итоговые коэффициенты.\n5) Если перегрев всё равно не уходит, пытайтесь снизить нагрузку (длинные высокотемпературные задачи делать с перерывом на остывание). Или установите дополнительный вентилятор для обдува платы.",
       "notes": "Полезно знать:\n- Иногда при перегреве MCU возникает ошибка E0011 (связанная с автокалибровкой), хотя по факту проблема в «MCU shutdown». В логах может быть видно.\n- «Соплемод» (удлинённый радиатор) часто упоминается как фактор изменения теплового баланса – электронике становится жарче внутри.\n- На свежих прошивках / кастомном Klipper вероятность зависания при высоких температурах ниже, так как там улучшен контроль температуры и «watchdog»."
     }
   ]
 }