{
    "category": "Продвинутые возможности и хардвер",
    "entries": [
      {
        "title": "Подключение внешнего контроллера (хоста) вместо родной электроники",
        "description": "Описание:\nЭнтузиасты иногда хотят использовать внешний контроллер (например, плату Raspberry Pi с Klipper или плату Marlin) **напрямую** для управления двигателями и датчиками принтера, обходя родную плату AD5M.",
        "solution": "Решение (общая схема):\n1) Изучить распиновку проводов (шаговые двигатели X/Y/Z, термисторы, нагреватели).\n2) Подключить их к внешней плате (Raspberry Pi + платка для драйверов, либо 32‑bit Marlin board) вместо стоковой.\n3) Настроить прошивку (Klipper, Marlin) под конфигурацию AD5M – длина осей, датчики уровня, тензодатчики (если хотите сохранить автоуровень).",
        "notes": "Полезно знать:\n- Это **очень сложный** мод, требующий понимания схем, навыков пайки, обрыва гарантии.\n- Некоторые пользователи делали проект: «принтер как голая механика, мозги на внешней плате». Можно найти инструкции на GitHub (VoronKor, проч.).\n- Гораздо проще вместо этого установить **KlipperMod** или **ZMod** на штатную плату, если нужна гибкость."
      },
      {
        "title": "Использование FlashForge API для интеграции с другими системами",
        "description": "Описание:\nУ AD5M есть скрытый сетевой API (которым пользуется FlashCloud). Хочется получить статус, отправлять задания или интегрировать принтер в Home Assistant / OctoDash и т.п.",
        "solution": "Решение:\n1) Сообщество разобрало протокол и написало документацию.\n2) Можно отправлять HTTP‑запросы (GET/POST) локально, получая температуру, прогресс, управляя нагревом/печатями.\n3) Нужен токен авторизации (или обход), см. подробную инструкцию в репозитории (например, IgorZyktin/FlashForgeAdventurer5MAPI).",
        "notes": "Полезно знать:\n- FlashForge официально не поддерживает этот «внутренний» API, так что будьте готовы к сюрпризам при обновлениях.\n- При грамотной настройке можно использовать RESTful интеграцию в HomeAssistant, кастомные панели управления, даже чат-ботов.\n- Без root‑доступа сложнее добыть токен, но есть способы (логирование, анализ сетевого трафика)."
      },
      {
        "title": "Увеличение памяти и замена CPU (Allwinner T113-S4)",
        "description": "Описание:\nНекоторые хотят расширить ОЗУ/CPU на штатной плате. Стоковый SoC Allwinner T113 может иметь только 128 МБ DDR3, а вариант T113-S4 – 256 МБ. Мод подразумевает замену микросхем.",
        "solution": "Решение (крайне продвинутое):\n1) Выпаять родной чип T113/память, установить T113-S4 с 256 МБ.\n2) Залить прошивку (например, модифицированный KlipperMod) с поддержкой большего объёма RAM.\n3) Убедиться, что всё заведётся без аппаратных конфликтов.",
        "notes": "Полезно знать:\n- Нужна специализированная аппаратура (ИК паяльная станция) и серьёзные навыки. Любая ошибка – плата безвозвратно погибнет.\n- Прирост для обычной печати незначителен; нужно лишь при экстремальных задачах (например, если принтер используется как «микро-сервер»).\n- Сильно рискуете гарантией и работоспособностью."
      },
      {
        "title": "Расширение функций прошивки (веб-интерфейс, FTP, макросы и пр.)",
        "description": "Описание:\nИмея root-доступ и фактически маленький Linux-компьютер внутри принтера, пользователь может захотеть установить доп. ПО (FTP-сервер, веб-сервер) или писать кастомные макросы в конфиге прошивки.",
        "solution": "Решение:\n1) **Установка сервисов** (nginx, vsftpd и т.п.) – вручную или через пакетный менеджер (opkg), если доступен. Настроить автозапуск, открыть нужные порты.\n2) **Кастомные макросы**: если прошивка – Klipper (в том числе стоковая, но закрытая), можно прописывать gcode_macro в printer.cfg. На стоковом FlashOS это затруднено (всё закрыто). На KlipperMod/ZMod – легко редактируется.\n3) **Веб-интерфейс**: Для полноценного Fluidd/Mainsail проще перейти на кастомную прошивку KlipperMod. Если хотите костыльно запустить Lighttpd/nginx прямо на стоке – придётся «допиливать».",
        "notes": "Полезно знать:\n- Любые правки конфигов и установка сервисов требует опыта работы с Linux, root-доступа.\n- Неправильно настроенный сервис может создать уязвимость в вашей сети (принтер торчит в интернете).\n- Храните бэкап оригинальной системы. В случае неудачи сможете вернуться на заводскую прошивку."
      },
      {
        "title": "Input Shaper, Pressure Advance и другие «тонкие» настройки (на кастомной прошивке)",
        "description": "Описание:\nНа стоковой прошивке FlashForge (FlashOS) не реализован прямой доступ к Input Shaper/PA через конфиг. На KlipperMod/ZMod их можно настроить и получить более высокое качество/скорость.",
        "solution": "Решение (лишь кратко):\n1) Поставить KlipperMod/ZMod, получить доступ к printer.cfg.\n2) Выполнить «Resonance Calibration» (Input Shaper) с акселерометром или вручную.\n3) Включить Pressure Advance (K-factor), подобрать оптимальное значение.\n4) Глобальные настройки (accel, jerk, S‑curve) – тоже редактируются через cfg.",
        "notes": "Полезно знать:\n- Это уже «прошивочные» аспекты, но относится и к продвинутому «хардверному» уровню, так как влияет на механику и позволяет выжимать максимум из AD5M.\n- На стоковой прошивке можно лишь ждать, что FlashForge сделает их доступными (маловероятно).\n- Калибровка Input Shaper может увеличить качество печати на высоких скоростях, убирая рябь/вибрации."
      }
    ]
  }