{
    "category": "Слайсеры и G-code",
    "entries": [
      {
        "title": "Выбор слайсера для AD5M/5M Pro",
        "description": "Описание:\nНовичку сложно определиться, каким программным обеспечением готовить модели для печати на этом принтере. Вариантов несколько: фирменный FlashPrint/Orca FlashForge, популярный OrcaSlicer (бывш. BambuStudio SoftFever), PrusaSlicer и др.",
        "solution": "Решение (рекомендации сообщества):\n• **OrcaSlicer (SoftFever)**: форк Bambu Studio, быстро развивается. Есть встроенный профиль для AD5M/Pro, поддерживает передовые функции (Pressure Advance, Input Shaper), Wi-Fi-отправку заданий. Интерфейс похож на PrusaSlicer, но более современный.\n• **Orca FlashForge**: фирменная модификация OrcaSlicer от FlashForge. Отличается интеграцией с FlashCloud/FlashMaker и редизайном. Имеет веб-интерфейс, но обновления выходят реже.\n• **PrusaSlicer**: надёжный и проверенный, но нет готового профиля для AD5M. Можно импортировать профиль Orca или вручную настроить. Новые фичи (Input Shaper) выходят чуть медленнее.\n• **Другие**: FlashPrint (устарел в плане функционала), Cura (нет профиля под AD5M), IdeaMaker от Raise3D (мало распространён). Обычно OrcaSlicer покрывает все нужды.",
        "notes": "Полезно знать:\n- Скачать OrcaSlicer можно в Releases на GitHub (версии 2.0.0+).\n- Orca FlashForge и OrcaSlicer нельзя рекомендовать устанавливать вместе (конфликт настроек). Лучше выбрать что-то одно.\n- FlashPrint сохраняет файлы .gx или .g, но по качеству траектории заметно уступает современным слайсерам."
      },
      {
        "title": "Можно ли установить одновременно OrcaSlicer и Orca FlashForge?",
        "description": "Описание:\nПользователь хочет иметь обе версии на одном ПК, полагая, что так получит и облако, и свежие обновления.",
        "solution": "Решение:\n• Не рекомендовано держать обе версии параллельно. Оптимально выбрать что-то одно.\n• Если крайне нужно — установите в разные папки и не позволяйте им использовать один и тот же каталог профилей.",
        "notes": "Полезно знать:\n- Orca FlashForge фактически тот же OrcaSlicer, но с бОльшей интеграцией с FlashCloud/FlashMaker, что вам может и не понадобиться.\n- Если просто хотите протестировать – сделайте бэкап профилей заранее."
      },
      {
        "title": "Принтер не начинает печать (файл не запускается)",
        "description": "Описание:\nЗадание на печать (Wi-Fi или флешка) отправлено, но принтер не движется, либо вовсе не видит модель в списке. Может «зависать» на 0%, время не идёт.",
        "solution": "Решение:\n1) Переименовать .gcode в .gco, упростить имя (латиницей, без пробелов).\n2) Проверить целостность файла (открыть в просмотрщике, сравнить хэш).\n3) Если печать по Wi-Fi зависла, попробуйте USB-флешку.\n4) Удалить лишние G-code команды из начала (M900 и т.п.), если прошивка их не знает.",
        "notes": "Полезно знать:\n- В инженерном меню есть опция проверки контрольной суммы файла.\n- Если принтер «думает», что печатает, но не двигается, возможно, это иной баг прошивки (попробуйте стоп и перезапуск)."
      },
      {
        "title": "Принтер зависает при возобновлении печати с паузы",
        "description": "Описание:\nПри паузе, запущенной из OrcaSlicer/OctoPrint, возобновление иногда вешает прошивку. Нужно перезагружать, задание теряется.",
        "solution": "Решение:\n1) Ставить паузу только через экран принтера (кнопка Pause). Возобновление там работает штатно.\n2) Избегать пауз со стороны слайсеров. Если нужно сменить филамент – планируйте через M600 или ручную паузу на экране.\n3) Если уже завис – только перезагрузка.",
        "notes": "Полезно знать:\n- Производитель знает об этой ошибке и, возможно, исправит в будущих прошивках.\n- Редко такое же случается в OctoPrint. Советы те же."
      },
      {
        "title": "Ошибка E0011 при автокалибровке стола (Auto Level failed)",
        "description": "Описание:\nПри запуске Auto Level, либо при старте печати (если включён автолевел), возникает код E0011 и процесс прерывается.",
        "solution": "Решение:\n1) Увеличить Z-offset (например, -0.20 → -0.10).\n2) Проверить датчики (Sensor Calibration) и кабели. Неисправный тензодатчик заменить.\n3) Очистить сопло, выполнить cold pull.\n4) Сбросить карту стола (Factory Reset, Clear bed mesh) и повторить автолевел.",
        "notes": "Полезно знать:\n- Иногда кабель хотэнда даёт плохой контакт, что имитирует сбой датчика.\n- Е0011 относится к автоуровню. Если вы видите похожую ошибку (E0015, E0010), ищите расшифровку отдельно."
      },
      {
        "title": "Принтер не отображает серийный номер (Unknown Serial)",
        "description": "Описание:\nВ разделе Info (Machine Info) серийник пустой, что иногда мешает привязке к FlashCloud.",
        "solution": "Решение (root-доступ необходим):\n1) Через SSH/SFTP открыть /opt/config/Adventurer5M.json.\n2) Найти \"printerSerialNumber\": \"\" и вписать реальный номер.\n3) Сохранить, перезагрузить.\n4) В Info появится правильный SN.",
        "notes": "Полезно знать:\n- Без root нельзя изменить этот файл обычными методами. Можно попросить поддержку FlashForge (дольше).\n- Если плата менялась по гарантии, она обычно «пустая», надо вписать старый SN."
      },
      {
        "title": "Ошибка E0017 (Move Queue Overflow) при печати сложных дуг",
        "description": "Описание:\nПри печати моделей с множеством дуговых сегментов (G2/G3) или на высоких скоростях может появиться E0017. Принтер останавливается, печать прерывается.",
        "solution": "Решение:\n1) **Отключить дуги**: В OrcaSlicer/PrusaSlicer убрать генерацию G2/G3, выводить всё G1-сегментами. Файл будет больше, но прошивка справится.\n2) **Настроить [gcode_arcs]** (если есть доступ к прошивке, напр. в KlipperMod). Увеличить resolution до 1.2–1.5, что снизит детализацию и нагрузку.\n3) **Снизить скорость** печати дугообразных участков или делать их полигонами.",
        "notes": "Полезно знать:\n- На стоковой прошивке нельзя редактировать gcode_arcs, значит, просто отключайте G2/G3.\n- Проверьте, нет ли чрезмерно мелкой сегментации в модели."
      }
    ]
  }