{
    "category": "Филамент (Материалы и их использование)",
    "entries": [
      {
        "title": "Рекомендованные температуры и параметры для основных материалов",
        "description": "Описание:\nПользователь не уверен, какие температуры экструдера и стола ставить для разных типов пластика (PLA, PETG, ABS и т.д.) на AD5M/Pro, и какие особенности учесть.",
        "solution": "Решение (общие ориентиры):\n• **PLA**: сопло ~200–210 °C, стол 50–60 °C. Обдув 100%. Закрытый корпус не нужен и даже вреден (PLA любит прохладу).\n• **PETG**: сопло ~230–250 °C (чаще 240°С), стол 70 °C. Обдув умеренный (30–50%). Нежелательны сквозняки, но и перегрев модели ни к чему.\n• **ABS/ASA**: сопло 240–260 °C, стол 90–100 °C, камера закрыта (желательно >50 °C внутри). Обдув выключен или минимальный. Печатать чуть медленнее, чтобы избежать отлипаний.\n• **TPU (гибкий)**: сопло ~220 °C, стол 50 °C, скорость низкая (20–40 мм/с). Обдув слабый. Учитывать особенности гибкого тракта (см. ниже).\n• **Нейлон, PC**: сопло 260–270 °C, стол 100–110 °C, камера закрыта. Нужна тщательная сушка. Пределы стокового хотэнда (если PTFE-накладка, температура обычно ограничена 290 °C). Желательно «высокотемпературный» хотэнд без PTFE.",
        "notes": "Полезно знать:\n- Смотрите рекомендации производителя на катушке (именно их учитывайте в приоритете).\n- Если печатаете PLA в закрытой камере, возможны тепловые деформации (так называемые «жевания» или «забивание сопла»).\n- Для высокотемпературных материалов (PC, нейлон) часто нужен хотэнд без PTFE и поддержка температуры стола >100 °C."
      },
      {
        "title": "«Плюётся» и потрескивает пластик при печати (влажный филамент)",
        "description": "Описание:\nИз хотэнда доносятся потрескивания, из сопла выходят пузырящиеся нити, возможны микровзрывы. На модели образуются шероховатости.",
        "solution": "Решение:\n1) **Просушка**: Для PLA/PETG ~55–60 °C на 4–6 часов; для нейлона/PC/ABS нередко 70–80 °C 6–8 часов. Используйте сушилку для филамента, духовку с терморегулятором или дегидратор.\n2) **Хранение**: В герметичном боксе с силикагелем.\n3) **Во время печати**: Если нет постоянной сушилки, старайтесь печатать сразу после просушки, не давая катушке снова увлажниться.\n4) (Временно) увеличить температуру сопла на +5–10 °C – но лучше всё же просушить.",
        "notes": "Полезно знать:\n- PETG, TPU и нейлон особенно гигроскопичны. PLA тоже может стать влажным, но обычно меньше страдает.\n- Признак намокания – слышимые «щелчки», маленькие капельки, ухудшение адгезии слоёв.\n- Сообщество рекомендует использовать специальные боксы или пакеты с силикагелем для хранения катушек."
      },
      {
        "title": "Печать гибким филаментом (TPU) – подача прутка заедает",
        "description": "Описание:\nПри печати TPU (Shore 95A/85A и т.п.) нить может застревать, прерываться, экструдера щелкает, возникают пропуски экструзии.",
        "solution": "Решение:\n1) **Минимизация ретрактов**: Уменьшить длину (например, до 1 мм) и скорость (до ~20 мм/с). Можно почти отключить ретракт для мелких моделей.\n2) **Скорость печати**: ~20–40 мм/с. TPU плохо ведёт себя на высоких скоростях.\n3) **Проверить тракт экструдера**: некоторые убирают пластиковый ограничитель внутри фидера AD5M, чтобы TPU не цеплялся.\n4) **Обдув радиатора**: обеспечьте нормальное охлаждение, чтобы мягкий пластик не «плавился» выше зоны плавления.",
        "notes": "Полезно знать:\n- TPU обычно хорошо липнет к PEI, иногда даже слишком. После остывания модель сама отскочит, особенно если стол опустится ниже ~40 °C.\n- Чем мягче TPU (меньше Shore), тем сложнее печать. Shore 95A для AD5M обычно достаточно дружелюбен."
      },
      {
        "title": "Композитные филаменты (с наполнениями дерева, углеволокна и т.д.)",
        "description": "Описание:\nПри использовании материалов с наполнением (дерево, карбон, металлическая пудра) могут чаще происходить засоры сопла, повышенный износ. Настройки отличаются от обычных PLA/PETG.",
        "solution": "Решение:\n1) **Сопло большего диаметра (0.6–0.8 мм)** или Hardened steel (закалённая сталь), чтобы уменьшить риск забивания и износа.\n2) **Скорость печати ниже**: композиты хуже проводят тепло, 40–60 мм/с обычно достаточно.\n3) **Температура**: может отличаться от «чистого» PLA/PETG. Изучайте рекомендации производителя композитного филамента.\n4) **Чистить сопло** (cold pull) регулярно, т.к. частички наполнителя накапливаются.",
        "notes": "Полезно знать:\n- Карбон и стекловолокно быстро «съедают» латунные сопла. Рекомендованы сопла из харденед стил (HRC50+) или волфрамовые.\n- Древесные филаменты (woodfill) тоже лучше печатать через 0.6 мм, чтобы исключить засоры древесными включениями.\n- Храните такие филаменты (особенно карбон) сухими, они тоже могут впитывать влагу."
      },
      {
        "title": "Частые засоры из-за некачественного пластика",
        "description": "Описание:\nЕсли филамент низкого качества (с примесями, нерегулярным диаметром), сопло будет постоянно забиваться, печать – прерываться.",
        "solution": "Решение:\n1) Использовать **качественные бренды** (ESUN, FDPlast, Prusament, и т.д.).\n2) **Сушить** материал при необходимости, ставить фильтр-протирку перед экструдером (кусочек поролона, который убирает пыль).\n3) **Cold pull** делать регулярно (каждые 100–200 ч печати).\n4) Проверять диаметр нити микрометром – если гуляет сильно (1.68–1.82 мм), такой пластик работать будет плохо.",
        "notes": "Полезно знать:\n- Слишком дешёвый «no-name» может сэкономить в моменте, но обернётся потраченным временем на чистку, испорченными деталями и более частой заменой сопел.\n- Не забывайте про смазку в тракте, если печатаете тысячи часов – следите за общей чистотой, пыль на нити тоже влияет."
      },
      {
        "title": "Общие советы по хранению и выбору филамента",
        "description": "Описание (обобщение):\nНезависимо от типа пластика (PLA, ABS, PETG, TPU, композиты), важно правильно хранить бобины и выбирать надёжных производителей.",
        "solution": "Рекомендации:\n• **Хранение**: герметичный контейнер/бокс с осушителем (силикагель). Если влажность в помещении высокая, лучше сразу убирать катушку, когда не печатаете.\n• **Сушка перед серьёзной печатью**: если проект крупный/важный, не поленитесь просушить бобину 2–4 часа при рекомендуемой t. Это избавит от «сюрпризов».\n• **Проверка диаметра**: катушки с заявлением «1.75 ± 0.02 мм» обычно более стабильны. Если пластик «пляшет» на 0.1–0.15 мм, ждите проблем.\n• **Настройки в слайсере**: температура, скорость, обдув – всё подбирайте по рекомендациям производителя и путём тестов (температурные башенки, цилиндры).\n• **Не храните долго без упаковки** филамент, особенно PETG/TPU/нейлон. Даже PLA при большой влажности станет «шуметь».",
        "notes": "Полезно знать:\n- Для AD5M/Pro можно печатать большинство доступных материалов, если соблюдать температурные ограничения (до ~260–270 °C для стока) и иметь закрытую камеру для ABS/ASA.\n- С композитами (карбон, дерево, металл) используйте желательно сопло Ø0.6+ и износостойкое.\n- Если при тестировании видите, что пластик прилипает недостаточно, поднимите температуру стола или добавьте клей/скотч – но сначала проверьте, не загрязнен ли стол."
      }
    ]
  }