{
   "category": "Экструдер и сопло (Hotend / Extruder Issues)",
   "entries": [
     {
       "title": "Пластик не подаётся, экструдер щёлкает (забилось сопло)",
       "description": "Описание:\nВо время печати прекращается выход пластика. Слышны характерные щелчки фидера — экструдер пытается протолкнуть нить, но проскальзывает. Печать идёт «вхолостую» (нить не выходит) или получается очень тонкая паутинка. Первый слой может оказаться пустым (воздушная печать).",
       "solution": "Решение:\n1) Прочистить сопло:\n   - **Метод Cold Pull (холодная вытяжка)**: Прогрейте хотенд (например, 220–250 °C для PLA/PETG или 260–280 °C для нейлона). Вставьте нейлоновую нить или специальную очищающую нить. Затем охладите хотенд до ~90–100 °C и резко вытяните нить. На её конце останутся частицы нагара и загрязнений. Повторите процедуру несколько раз для полного очищения.\n   - **Механическая прочистка**: Прогрейте сопло до рабочей температуры (~220–250 °C), аккуратно прочистите отверстие тонкой иглой или ёршиком, убирая налипший пластик. Будьте осторожны, чтобы не сломать иглу внутри.\n2) Прогнать старый пластик на повышенной температуре:\n   - Если переходите с PLA на PETG, нагрейте экструдер до ~230–240 °C и продавите PLA, чтобы «вымыть» остатки. Это снижает риск смешивания материалов и засора.\n3) Проверить и обслужить термобарьер:\n   - Убедитесь, что радиатор хотэнда обдувается вентилятором и нет перегрева. При постоянных засорах из-за «тепловой пробки» может потребоваться замена термобарьера или улучшенный обдув.\n4) Следить за качеством/сухостью филамента:\n   - Влажный либо некачественный пластик чаще оставляет отложения. Регулярно сушите катушки (PLA/PETG ~55–60 °C несколько часов), храните их в герметичных контейнерах с силикагелем.\n5) Если засор сильный или хронический:\n   - Установите новое сопло (картридж). В редких случаях внутри нового принтера может оказаться лишний герметик, который нужно удалить.",
       "notes": "Полезно знать:\n- TPU и композитные материалы (дерево, углеволокно) более склонны к засорам. Иногда проще печатать через сопло Ø0.6 мм.\n- Если слышны щелчки экструдера (клацанье), а пластик не выходит, лучше сразу остановить печать и прочистить сопло, чтобы не портить модель.\n- Следите за чистотой зубцов экструдера: накопившаяся пластиковая пыль также вызывает проскальзывание."
     },
     {
       "title": "Сопло царапает поверхность стола",
       "description": "Описание:\nВо время печати или при перемещениях видно, как сопло физически задевает стол. На покрытии (PEI/ультрабаза) остаются царапины или борозды, чаще всего при укладке первого слоя.",
       "solution": "Решение:\n1) Перекалибровать Z-offset:\n   - В меню принтера (Leveling → Z-offset) увеличьте зазор (на +0.05–0.1 мм).\n   - При ручной проверке (бумажкой) добейтесь лёгкого трения, без сильного зажима.\n2) Обновить карту стола (Bed Level):\n   - Запустите Auto Level заново. Если возникают ошибки (например, E0011), устраните их (проверьте датчики, сместите оффсет и т. д.).\n   - Можно сбросить старую карту в инженерном меню и создать новую, если прошлые измерения были неверны.\n3) Включить Z-hop (в слайсере):\n   - Установите подъём сопла (0.5–1 мм) при перемещениях по уже напечатанному слою, чтобы не задевать выступающие участки.",
       "notes": "Полезно знать:\n- Если царапины уже возникли, их можно аккуратно заполировать спиртом или очень мелкой шкуркой (если не глубокие).\n- Многие ставят чуть больший Z-offset (ещё +0.025–0.05 мм), чтобы гарантированно избежать соприкосновений.\n- Следите, чтобы на столе не было капель застывшего пластика, которые могут задеваться соплом, вызывая скрежет."
     },
     {
       "title": "Задержка подачи пластик в начале печати (пустой старт)",
       "description": "Описание:\nПри запуске нового задания пластик не сразу начинает выходить из сопла. Экструдер двигается, а нить укладывается лишь через пару секунд. Итог — первый слой с пропусками, воздушные участки в месте старта.",
       "solution": "Решение:\n1) Очистить сопло (cold pull) или заменить, если оно старое и проплавляется с задержкой.\n2) Скорректировать ретракты:\n   - Для Direct Drive типа AD5M обычно достаточно 0.5–1 мм отката. Если стоит 2–3 мм, может образовываться «воздушная» зона, и пластик приходит с опозданием.\n   - Убедитесь, что после ретракта идёт соответствующая восподача (prime).\n3) Стартовый прожиг (Skirt, Brim, prime line):\n   - Почти все слайсеры умеют печатать «линию сбоку» перед моделью, чтобы сопло уже было заполнено.\n4) Если меняете материал на более низкотемпературный (например, c ABS на PLA):\n   - Прогоните старый пластик на температуре нового +10–20 °C, чтобы устранить остатки.",
       "notes": "Полезно знать:\n- Если при прогреве из сопла подкапывает, а потом сразу возникает «пустой старт», это нормально: капли вышли, внутри временная «пустота». Стартовый прожиг легко решает проблему.\n- В некоторых слайсерах есть параметр «Extra Restart Distance». Его небольшое увеличение (порядка 0.1–0.2 мм³) может компенсировать утечку и убрать пропуски в начале слоя."
     },
     {
       "title": "Пластик протекает сверху или сбоку из зоны хотэнда",
       "description": "Описание:\nПри печати расплав выходит не только из жиклёра, но и вытекает сверху/сбоку (капли появляются на нагревательном блоке). Опасно, так как пластик может попасть на электронику.",
       "solution": "Решение:\n1) Немедленно прервите печать и остудите принтер, чтобы не усугубить протечку.\n2) Снимите старый картридж (на разогретом хотэнде ~200–230 °C, чтобы убрать пластик). Очистите резьбу.\n3) Установите новый картридж-сопло. Важно: затягивать на горячую (230–250 °C), чтобы металлические детали были в рабочем расширенном состоянии и не было зазора после остывания.\n4) При необходимости можно использовать термостойкий герметик (выдерживающий 300 °C+), но обычно достаточно правильной горячей затяжки.",
       "notes": "Полезно знать:\n- Лучше не доводить до протечек: регулярно проверяйте сопло на люфт и подтягивайте после первого нагрева. Заводской компаунд со временем трескается. Многие опытные пользователи просто удаляют его и рассчитывают на металл-металл затяжку.\n- Если пластик уже натёк на термодатчик/провода, аккуратно уберите его при нагреве (не тяните холодный).\n- При повторных протечках может быть повреждён сам нагревательный блок или трубка теплоотвода."
     },
     {
       "title": "Частые засоры из-за некачественного пластика",
       "description": "Описание:\nПринтер стабильно забивается только на определённом типе филамента (дешёвом PETG, TPU, композитных материалах). На другом пластике печатает нормально.",
       "solution": "Решение:\n1) **Сушить филамент** (PLA/PETG при ~55–60 °C несколько часов, ABS/ASA/нейлон — выше).\n2) **Фильтр-протирка**: установить на входе в экструдер кусочек поролона, он убирает пыль и может быть слегка пропитан маслом (силиконовым) для снижения трения.\n3) **Сопло большего диаметра** (0.6 мм) для проблемных материалов (гибких, наполненных).\n4) **Регулярная чистка** (cold pull каждые 100–200 ч печати), особенно при смене пластика.\n5) **Используйте проверенный филамент**. Слишком дешёвый материал часто экономит на составе и стабильности.",
       "notes": "Полезно знать:\n- Наполненные (дерево, карбон) быстрее изнашивают сопло и чаще забивают его. Для них берут hardened steel сопла и увеличенный диаметр.\n- Если переходите с PLA на PETG, сделайте «горячую промывку»: поднимите температуру до 230–240 °C, выдавите PLA, чтобы вывести остатки перед тем, как ставить PETG.\n- Храните катушки в герметичных контейнерах с осушителем (силикагель). Влажный PLA/PETG — одна из основных причин засоров."
     },
     {
       "title": "Невозможно разобрать сопло (картридж неразборный)",
       "description": "Описание:\nШтатные сопла-картриджи FlashForge Adventurer 5M представляют собой цельный модуль. Попытки «открутить» жиклёр, вынуть внутреннюю трубку или разобрать блок приводят к повреждениям. С завода всё запаяно герметиком.",
       "solution": "Решение:\n1) Не пытайтесь разбирать стоковый картридж. Если он засорён безвозвратно — проще заменить целиком.\n2) Приобретайте фирменные картриджи (0.4 мм стандарт, 0.6/0.8 мм и др.). Меняются «на горячую»:\n   - Прогреть старый до ~200 °C, выключить питание и аккуратно вынуть (осторожно: горячо!).\n   - Вставить новый, включить принтер, нагреть и подтянуть крепёж.\n   - Перекалибровать Z-offset, так как высота сопла может немного отличаться.\n3) Для продвинутых пользователей существуют **кастомные хотэнды (моды)**:\n   - Например, «Bambu Lab X1 hotend mod», «Creality K1 mod» или **«соплемод» (соплямод)** — разработка русскоязычного сообщества, где радиатор и трубка переосмыслены, чтобы ставить обычные съёмные жиклёры.\n   - Как правило, такой модуль длиннее или иначе устроен, поэтому требует доп. настроек прошивки (длина сопла, PID, калибровка автоуровня).\n   - Моды часто влияют на тепловой баланс хотэнда. Может понадобиться усиленный обдув внутри корпуса, иначе возможен перегрев MCU.\n4) Если принтер на гарантии:\n   - Уточните у продавца, не теряете ли гарантию при смене хотэнда на модифицированный.",
       "notes": "Полезно знать:\n- В нерaзборном картридже штатно залит герметик. Заводом не предусмотрено извлекать/менять внутреннюю трубку.\n- «Соплемод» даёт разборный узел: вы сможете менять сопла и обслуживать термобарьер. Но установка требует аккуратной механической подгонки и прошивочных правок.\n- Для новичков надёжнее использовать штатные картриджи и просто менять их при сильном износе или засоре."
     }
   ]
 }